import React from 'react'

const Philosophy = () => {
  return (
    <section className='philosophy'>
      <div className='philosophy__container'>
        <div className='philosophy__left'>
          <h2>
            OUR
            <br /> PHILOSOPHY
          </h2>

          <div className='philosophy__bg'>
            <svg
              xmlns='http://www.w3.org/2000/svg'
              aria-label='philosophy'
              width='840'
              height='600'
              viewBox='0 0 840 600'
            >
              <g id='bg' transform='translate(-0.012 0.038)'>
                <path
                  id='パス_304'
                  d='M342.609,3388.192a729.16,729.16,0,0,0-103.4,56.393,635.673,635.673,0,0,0-85.6,66.891,493.431,493.431,0,0,0-65,73.49c-18,25.3-32,50.894-41.6,76.091-9.8,25.8-15.1,51.094-15.5,75.19a172.046,172.046,0,0,0,3.1,35.8,156.392,156.392,0,0,0,23.7,57.392,167.34,167.34,0,0,0,16.6,20.9,184.221,184.221,0,0,0,20.1,18.4,202.953,202.953,0,0,0,23.3,15.8,260.434,260.434,0,0,0,55.3,23.9,371.775,371.775,0,0,0,65.2,13.4,480.836,480.836,0,0,0,73,2.5,593.838,593.838,0,0,0,78.7-8.6,684.991,684.991,0,0,0,82.3-19.9,736.289,736.289,0,0,0,83.9-31.5l1.3-.6a729.162,729.162,0,0,0,103.4-56.393,635.672,635.672,0,0,0,85.6-66.891,493.431,493.431,0,0,0,65-73.49c18-25.3,32-50.894,41.6-76.091,9.8-25.8,15.1-51.094,15.5-75.19a172.047,172.047,0,0,0-3.1-35.8,156.391,156.391,0,0,0-23.7-57.392,167.346,167.346,0,0,0-16.6-20.9,184.221,184.221,0,0,0-20.1-18.4,202.954,202.954,0,0,0-23.3-15.8,259.037,259.037,0,0,0-55.4-23.9,371.773,371.773,0,0,0-65.2-13.4,480.836,480.836,0,0,0-73-2.5,593.837,593.837,0,0,0-78.7,8.6,684.991,684.991,0,0,0-82.3,19.9,736.284,736.284,0,0,0-83.9,31.5l-1.2.6m-.4-.9,1.3-.6C567.715,3287,797.221,3313.4,856.122,3445.584c58.8,131.983-74.5,319.459-297.908,419.346l-1.3.6C332.708,3965.218,103.2,3938.822,44.3,3806.638c-58.8-131.983,74.5-319.559,297.908-419.346Z'
                  transform='translate(-30 -3326)'
                  fill='#3b720e'
                  opacity='0.5'
                />
                <path
                  id='パス_303'
                  d='M342.209,3863.731l1.3.6a736.289,736.289,0,0,0,83.9,31.5,684.944,684.944,0,0,0,82.3,19.9,593.839,593.839,0,0,0,78.7,8.6,481.724,481.724,0,0,0,73-2.5,354.392,354.392,0,0,0,65.2-13.4,263.376,263.376,0,0,0,55.3-23.9,202.954,202.954,0,0,0,23.3-15.8,175.483,175.483,0,0,0,20.1-18.4,159.492,159.492,0,0,0,40.3-78.29,172.047,172.047,0,0,0,3.1-35.8c-.4-24.1-5.6-49.394-15.5-75.29-9.6-25.3-23.6-50.894-41.6-76.09a499.13,499.13,0,0,0-65-73.491,635.656,635.656,0,0,0-85.6-66.891,739.307,739.307,0,0,0-103.4-56.393l-1.3-.6a736.287,736.287,0,0,0-83.9-31.5,684.945,684.945,0,0,0-82.3-19.9,593.838,593.838,0,0,0-78.7-8.6,481.723,481.723,0,0,0-73,2.5,354.391,354.391,0,0,0-65.2,13.4,263.377,263.377,0,0,0-55.3,23.9,202.954,202.954,0,0,0-23.3,15.8,175.467,175.467,0,0,0-20.1,18.4,159.489,159.489,0,0,0-40.3,78.29,172.043,172.043,0,0,0-3.1,35.8c.4,24.1,5.6,49.394,15.5,75.29,9.6,25.3,23.6,50.894,41.6,76.091a499.139,499.139,0,0,0,65,73.49,635.653,635.653,0,0,0,85.6,66.891,729.164,729.164,0,0,0,103.4,56.393m-.4.9C118.4,3764.744-14.9,3577.268,43.9,3445.285c58.9-132.183,288.508-158.58,512.614-58.893l1.3.6c223.406,99.887,356.71,287.363,297.908,419.346-58.9,132.183-288.508,158.58-512.614,58.892Z'
                  transform='translate(-30 -3326)'
                  fill='#3b720e'
                  opacity='0.5'
                />
              </g>
            </svg>

            <p>
              WE
              <br />
              WE ARE
              <br />
              WE ARE FAMILY.
            </p>
          </div>
        </div>

        <div className='philosophy__right'>
          <div className='philosophy__top'>
            <h2 className='times-fonts'>
              I love the way you <br />
              do things. And I <br />
              love the way <br />
              you don’t.
            </h2>

            <div className='vertical'>
              <div className='line'></div>
              <p>矛 盾 を 楽 し む</p>
            </div>
          </div>

          <div className='philosophy__mid'>
            <p>
              たとえば、私たちはものづくりを愛しています。一
              方で、ものを作れば作るほど、地球環境に負荷がかかるという、いまの現実もあります。「新しいものを生み出したいというワクワク感」と「多くの人に届けたいという気持ち」、その対向にある「環境負荷」や「持続可能性」との矛盾。
            </p>

            <p>
              世の中にたくさんある、そんな矛盾をポジティブに超えていく方法を考え続けたい。矛盾を内包することで生まれる寛容性の高いオープンネスをもって、対話を続けることで、ものを生み出す。分断・排他を否定し、グレーのグラデーションのなかに、できるだけ誰も見捨てない最適解を見つけていく。感性を大切にしながら、軽やかに、力強く。
            </p>
          </div>

          <div className='philosophy__bot'>
            <p>
              For example, we love making things whereas making more things causes a burden on the global environment.
              There is a contradiction: the excitement to create something new and share with many people vs.
              environmental load and sustainability.
            </p>

            <p>
              We would like to keep thinking ways to positively overcome these contradictions that exist in the world.
              Create things by continuing dialogue with the openness mind that comes from embracing the contradictions.
              We deny division and exclusion. And we seek to find the best solution that will not abandon anyone as much
              as possible, lightly and powerfully by valuing sense.
            </p>
          </div>
        </div>
      </div>
    </section>
  )
}

export default Philosophy
